using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace MushaLib.Utilities
{
    public static class KanaConverter
    {
        /// <summary>
        /// 濁点変換テーブル
        /// </summary>
        public static IReadOnlyDictionary<string, string> DakutenTable { get; } = new Dictionary<string, string>
        {
            { "か", "が" }, { "き", "ぎ" }, { "く", "ぐ" }, { "け", "げ" }, { "こ", "ご" },
            { "さ", "ざ" }, { "し", "じ" }, { "す", "ず" }, { "せ", "ぜ" }, { "そ", "ぞ" },
            { "た", "だ" }, { "ち", "ぢ" }, { "つ", "づ" }, { "て", "で" }, { "と", "ど" },
            { "は", "ば" }, { "ひ", "び" }, { "ふ", "ぶ" }, { "へ", "べ" }, { "ほ", "ぼ" },
            { "ぱ", "ば" }, { "ぴ", "び" }, { "ぷ", "ぶ" }, { "ぺ", "べ" }, { "ぽ", "ぼ" },
            { "カ", "ガ" }, { "キ", "ギ" }, { "ク", "グ" }, { "ケ", "ゲ" }, { "コ", "ゴ" },
            { "サ", "ザ" }, { "シ", "ジ" }, { "ス", "ズ" }, { "セ", "ゼ" }, { "ソ", "ゾ" },
            { "タ", "ダ" }, { "チ", "ヂ" }, { "ツ", "ヅ" }, { "テ", "デ" }, { "ト", "ド" },
            { "ハ", "バ" }, { "ヒ", "ビ" }, { "フ", "ブ" }, { "ヘ", "ベ" }, { "ホ", "ボ" },
            { "パ", "バ" }, { "ピ", "ビ" }, { "プ", "ブ" }, { "ペ", "ベ" }, { "ポ", "ボ" },
            { "ウ", "ヴ" },
        };

        /// <summary>
        /// 半濁点変換テーブル
        /// </summary>
        public static IReadOnlyDictionary<string, string> HandakutenTable { get; } = new Dictionary<string, string>
        {
            { "は", "ぱ" }, { "ひ", "ぴ" }, { "ふ", "ぷ" }, { "へ", "ぺ" }, { "ほ", "ぽ" },
            { "ば", "ぱ" }, { "び", "ぴ" }, { "ぶ", "ぷ" }, { "べ", "ぺ" }, { "ぼ", "ぽ" },
            { "ハ", "パ" }, { "ヒ", "ピ" }, { "フ", "プ" }, { "ヘ", "ペ" }, { "ホ", "ポ" },
            { "バ", "パ" }, { "ビ", "ピ" }, { "ブ", "プ" }, { "ベ", "ペ" }, { "ボ", "ポ" },
        };
    }
}
