using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace MushaLib.DQ.TextInput
{
    /// <summary>
    /// テキストテーブルの提供
    /// </summary>
    public class TextTableProvider
    {
        /// <summary>
        /// テキストテーブル
        /// </summary>
        private static readonly IReadOnlyDictionary<TextInputMode, string[]> TextTables = new Dictionary<TextInputMode, string[]>
        {
            {
                TextInputMode.Hiragana, new string[]
                {
                    "あ", "い", "う", "え", "お", "は", "ひ", "ふ", "へ", "ほ",
                    "か", "き", "く", "け", "こ", "ま", "み", "む", "め", "も",
                    "さ", "し", "す", "せ", "そ", "や", "",   "ゆ", "",   "よ",
                    "た", "ち", "つ", "て", "と", "ら", "り", "る", "れ", "ろ",
                    "な", "に", "ぬ", "ね", "の", "わ", "",   "を", "",   "ん",
                    "ぁ", "ぃ", "ぅ", "ぇ", "ぉ", "ゃ", "",   "ゅ", "",   "ょ",
                    "",   "",   "っ", "",   "",   "ゎ", "",   "",   "",   "ー",
                    "",   "ア", "",   "Ａ", "",   "゛", "゜", "←", "→", "OK"
                }
            },
            {
                TextInputMode.Katakana, new string[]
                {
                    "ア", "イ", "ウ", "エ", "オ", "ハ", "ヒ", "フ", "ヘ", "ホ",
                    "カ", "キ", "ク", "ケ", "コ", "マ", "ミ", "ム", "メ", "モ",
                    "サ", "シ", "ス", "セ", "ソ", "ヤ", "",   "ユ", "",   "ヨ",
                    "タ", "チ", "ツ", "テ", "ト", "ラ", "リ", "ル", "レ", "ロ",
                    "ナ", "ニ", "ヌ", "ネ", "ノ", "ワ", "",   "ヲ", "",   "ン",
                    "ァ", "ィ", "ゥ", "ェ", "ォ", "ャ", "",   "ュ", "",   "ョ",
                    "",   "",   "ッ", "",   "",   "ヮ", "",   "",   "",   "ー",
                    "",   "あ", "",   "Ａ", "",   "゛", "゜", "←", "→", "OK"
                }
            },
            {
                TextInputMode.Alphabet, new string[]
                {
                    "Ａ", "Ｂ", "Ｃ", "Ｄ", "Ｅ", "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ",
                    "Ｋ", "Ｌ", "Ｍ", "Ｎ", "Ｏ", "Ｐ", "Ｑ", "Ｒ", "Ｓ", "Ｔ",
                    "Ｕ", "Ｖ", "Ｗ", "Ｘ", "Ｙ", "Ｚ", "",   "・",   "",   "",
                    "ａ", "ｂ", "ｃ", "ｄ", "ｅ", "ｆ", "ｇ", "ｈ", "ｉ", "ｊ",
                    "ｋ", "ｌ", "ｍ", "ｎ", "ｏ", "ｐ", "ｑ", "ｒ", "ｓ", "ｔ",
                    "ｕ", "ｖ", "ｗ", "ｘ", "ｙ", "ｚ", "",   "－",   "",   "",
                    "０", "１", "２", "３", "４", "５", "６", "７", "８", "９",
                    "",   "あ", "",   "ア", "",   "",   "",   "←", "→", "OK"
                }
            },
        };

        /// <summary>
        /// 現在の入力モード
        /// </summary>
        public TextInputMode CurrentMode { get; set; }

        /// <summary>
        /// テキストテーブルの取得
        /// </summary>
        public string[] GetTextTable() => TextTables[CurrentMode];
    }
}
